#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    int a[15];//создаем массив
    //Пунгхт а
    for (int i = 0; i < 15; i++) { //условия массива
        cin >> a[i];//вводим данные массива
    }
    for (int i = 0; i < 15; i += 5) {//внешний цикл (точка отсчета для минималки числа)
        int min = a[i]; 
        for (int j = 1; j < 5; j++) {//внутреннний цикл (расчет минималки относительно начального числа)
            if (a[i + j] < min) {
                min = a[i + j];
            }
        }
        cout << "Min " << (i / 5) + 1 << "-th five: " << min << endl; //номер пятерки + минималка
        
    }
    //Пунгхт б
    sort(a, a + 15);
    for (int i = 0; i < 15; i++) {
        cout << a[i] << " ";
    }
    //Пунгхт в
    int f = 0;//счетчик
    int i = 0;//индекс массива
    while (i < 15) {
        int j = i;
        while (j < 15 && a[j] == a[i]) j++;  //подбор кода по типу замка от велика
        if (j - i > 1) {                                  
            f++;
        }
        i = j; //возвращаемся к моменту на котором остановились                                           
    }
    cout << '\n' << f << endl;
    //Пунгхт г
    
}
