#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    int a[15];
    int b[15];
    //создаем массив
    //Пунгхт а
    for (int i = 0; i < 15; i++) { //условия массива
        cin >> a[i];//вводим данные массива
    }
    for (int i = 0; i < 15; i++) { //делаем копию массива для задания г)
        b[i] = a[i];
    }
    for (int i = 0; i < 15; i += 5) {//внешний цикл (точка отсчета для минималки числа)
        int min = a[i]; 
        for (int j = 1; j < 5; j++) {//внутреннний цикл (расчет минималки относительно начального числа)
            if (a[i + j] < min) {
                min = a[i + j];
            }
        }
        cout << "Min " << (i / 5) + 1 << "-th five: " << min << endl; //номер пятерки + минималка
        
    }
    //Пунгхт б
    sort(a, a + 15);
    for (int i = 0; i < 15; i++) {
        cout << a[i] << " ";
    }
    //Пунгхт в
    int f = 0;//счетчик
    int i = 0;//индекс массива
    while (i < 15) {
        int j = i;
        while (j < 15 && a[j] == a[i]) j++;  //подбор кода по типу замка от велика
        if (j - i > 1) {                                  
            f++;
        }
        i = j; //возвращаемся к моменту на котором остановились                                           
    }
    cout << '\n' << f << endl;
    //Пунгхт г
    int s = -1;
    for (int i = 0; i < 15; i++) {
        if (b[i] > 0 && (b[i] & (b[i] - 1)) == 0) { //проверяем, что число - степень двойки и > 0, так как 
        //0 & -1 = 0 (-1 и 0 значит что все еще не нашли последовательность)
        //&-степенное деление
            int m = 2 * b[i]; //ожидается, что следующее число будет в два раза больше
            int j = i + 1; //начинаем проверку со следующего индекса
            while (j < 15 && b[j] == m) { 
                m *= 2;//если совпало, удваиваем ожидание для следующего шага
                j++;//берем след число массива
            }
            if (j - i - 1 >= 1) { //число элементов после первого, которые успешно совпали
                s = i;
                break;
            }
        }
    }
    if (s != -1) {
        cout << "Starts from: " << s << endl;
    }
    else {
        cout << "Not Found" << endl;
    }
    
}
