#include <iostream>
#include <clocale>

using namespace std;

int main()
{
    int a[10] = { 0 }; //создаем массивф
    int b[10] = { 0 }; //10-запас для транзита чисел

    cout << "Massive a:" << endl;
    for (int i = 0; i < 5; i++) {
        cin >> a[i];
    }

    cout << "Massive b:" << endl;
    for (int i = 0; i < 5; i++) {
        cin >> b[i];
    }
    for (int i = 0; i < 9; i++) {//сортировка массива а
        for (int j = 0; j < 9 - i; j++) {
            if (a[j] <= 0 && a[j + 1] > 0) {// перемещаем положительные в начало
                int t = a[j];
                a[j] = a[j + 1];
                a[j + 1] = t;
            }
        }
    }
    for (int i = 0; i < 9; i++) {
        for (int j = 0; j < 9 - i; j++) {
            if (a[j] == 0 && a[j + 1] != 0) {// нули в конец
                int t = a[j];
                a[j] = a[j + 1];
                a[j + 1] = t;
            }
        }
    }
    for (int i = 0; i < 9; i++) {//сортировка массива б
        for (int j = 0; j < 9 - i; j++) {
            if (b[j] >= 0 && b[j + 1] < 0) {//отрицательные в начало
                int t = b[j];
                b[j] = b[j + 1];
                b[j + 1] = t;
            }
        }
    }
    for (int i = 0; i < 9; i++) {
        for (int j = 0; j < 9 - i; j++) {
            if (b[j] == 0 && b[j + 1] != 0) {//нули в конец
                int t = b[j];
                b[j] = b[j + 1];
                b[j + 1] = t;
            }
        }
    }

    for (int i = 0; i < 5; i++) {//заходим в массив а, находим отрицательный элемент и перемещаем их в массив б
        if (a[i] < 0) {//если в a есть отрицательное
            for (int j = 0; j < 10; j++) {
                if (b[j] >= 0) {//ищем в b неотрицательное число 
                    int t = a[i];//меняем местами
                    a[i] = b[j];
                    b[j] = t;
                    break;//переходим к следующему числу в a
                }
            }
        }
    }

    for (int j = 0; j < 5; j++) {//заходим в массив б, находим положительные элементы и перекидываем в массив а
        if (b[j] > 0) {//если в b есть положительные
            for (int i = 0; i < 10; i++) {
                if (a[i] <= 0) {//ищем в a ноль (свободное место для записи)
                    int t = b[j];//меняем местами
                    b[j] = a[i];
                    a[i] = t;
                    break;//переходим к следующему числу в b
                }
            }
        }
    }

    cout << "New a:" << endl;//выводим новый массивы
    for (int i = 0; i < 10; i++) {
        cout << a[i] << " ";
    }

    cout << "\nNew b:" << endl;
    for (int j = 0; j < 10; j++) {
        cout << b[j] << " ";
    }
}
